package com.syndicate42.stem

import org.specs._
import org.specs.runner._

class RussianStemmerTest extends SpecificationWithJUnit {

  "stemmer" should {
    "stem the text correctly" in {
        val result = 
          List("я","не","думаю","что","открою","америку","если"
          ,"скажу","что","не","вся","информация","одинаково"
          ,"полезна","иногда","для","объяснения","какого","то"
          ,"понятия","необходимо","написать","много","текста"
          ,"а","иногда","для","объяснения","сложнейших","вопросов"
          ,"достаточно","посмотреть","на","простую","диаграмму").map(x=> {
            RussianStemmer.stem(x)
          }) 
        result must be equalTo(List(
          "я", "не", "дума", "что", "откр", "америк", "есл"
          ,"скаж", "что", "не", "вся", "информац", "одинаков", "полезн"
          ,"иногд", "для", "объяснен", "как", "то", "понят", "необходим"
          ,"написа", "мног", "текст", "а", "иногд", "для", "объяснен"
          ,"сложн", "вопрос", "достаточн", "посмотрет", "на", "прост", "диаграмм"
        ))
    }
    "stem и correctly" in {
      RussianStemmer.stem("и") must be equalTo("и")
    }
    "pass standard snowball stemmer tests" in {
      List(
        "в","вавиловка","вагнера","вагон","вагона","вагоне"
        ,"вагонов","вагоном","вагоны","важная","важнее"
        ,"важнейшие","важнейшими","важничал","важно"
        ,"важного","важное","важной","важном","важному"
        ,"важности","важностию","важность","важностью"
        ,"важную","важны","важные","важный","важным"
        ,"важных","вазах","вазы","вакса","вакханка"
        ,"вал","валандался","валентина","валериановых"
        ,"валерию","валетами","вали","валил","валился"
        ,"валится","валов","вальдшнепа","вальс"
        ,"вальса","вальсе","вальсишку"
        ,"вальтера","валяется","валялась"
        ,"валялись","валялось","валялся","валять"
        ,"валяются","вам","вами"

	,"п","па","пава","павел"
        ,"павильон","павильонам","павла","павлиний"
        ,"павлиньи","павлиньим","павлович","павловна"
        ,"павловне","павловной","павловну","павловны"
        ,"павловцы","павлыч","павлыча","пагубная"
        ,"падает","падай","падал","падала"
        ,"падаль","падать","падаю","падают"
        ,"падающего","падающие","падеж","падение"
        ,"падением","падении","падений","падения"
        ,"паденье","паденья","падет","падут"
        ,"падучая","падчерицей","падчерицы","падшая"
        ,"падшей","падшему","падший","падшим"
        ,"падших","падшую","паек","пазухи"
        ,"пазуху","пай","пакет","пакетом"
        ,"пакеты","пакостей","пакостно","пал"
      ).map(x=> {
        RussianStemmer.stem(x)
      }) must be equalTo(List(
        "в","вавиловк","вагнер","вагон","вагон","вагон"
        ,"вагон","вагон","вагон","важн","важн"
        ,"важн","важн","важнича","важн"
        ,"важн","важн","важн","важн"
        ,"важн","важност","важност","важност","важност"
        ,"важн","важн","важн","важн","важн"
        ,"важн","ваз","ваз","вакс","вакханк"
        ,"вал","валанда","валентин","валерианов"
        ,"валер","валет","вал","вал","вал"
        ,"вал","вал","вальдшнеп","вальс"
        ,"вальс","вальс","вальсишк"
        ,"вальтер","валя","валя"
        ,"валя","валя","валя","валя"
        ,"валя","вам","вам"

        ,"п","па","пав","павел"
        ,"павильон","павильон","павл","павлин"
        ,"павлин","павлин","павлович","павловн"
        ,"павловн","павловн","павловн","павловн"
        ,"павловц","павлыч","павлыч","пагубн"
        ,"пада","пада","пада","пада"
        ,"падал","пада","пада","пада"
        ,"пада","пада","падеж","паден"
        ,"паден","паден","паден","паден"
        ,"паден","паден","падет","падут"
        ,"падуч","падчериц","падчериц","падш"
        ,"падш","падш","падш","падш"
        ,"падш","падш","паек","пазух"
        ,"пазух","па","пакет","пакет"
        ,"пакет","пакост","пакостн","пал"
      ))
    }
  }
}

